Repository: maximemenager/zxcvbn-elixir
Catalog: priv/gettext/*/LC_MESSAGES/feedback.po
Languages: fr

source: Straight rows of keys are easy to guess
fr: Les suites de touches voisines sont simples à deviner

source: A word by itself is easy to guess
fr: Un seul mot est simple à deviner

source: Add another word or two. Uncommon words are better.
fr: Ajoutez un mot ou deux. Les mots peu communs sont mieux.

source: All-uppercase is almost as easy to guess as all-lowercase
fr: Variez les minuscules et majuscules

source: Avoid dates and years that are associated with you
fr: Évitez les dates et années qui vous sont associées

source: Avoid recent years
fr: Évitez les années récentes

source: Avoid repeated words and characters
fr: Évitez de répéter des mots ou des caractères

source: Avoid sequences
fr: Évitez les séquences

source: Avoid years that are associated with you
fr: Évitez les années qui vous sont associées

source: Capitalization doesn't help very much
fr: Mettre une majuscule au début n'est pas efficace

source: Common names and surnames are easy to guess
fr: Les noms communs et les pseudonymes sont faciles à deviner

source: Dates are often easy to guess
fr: Les dates sont souvent faciles à deviner

source: Names and surnames by themselves are easy to guess
fr: Les noms et surnoms sont faciles à deviner

source: No need for symbols, digits, or uppercase letters
fr: Il n'y a pas besoin de caractères spéciaux, de chiffres ou de majuscules

source: Predictable substitutions like '@' instead of 'a' don't help very much
fr: Les substitutions classiques comme '@' au lieu de 'a' sont faciles à deviner

source: Recent years are easy to guess
fr: Évitez les années récentes

source: Repeats like "aaa" are easy to guess
fr: Les répétitions comme "aaa" sont simples à deviner

source: Repeats like "abcabcabc" are only slightly harder to guess than "abc"
fr: Les répétitions comme "abcabcabc" sont aussi simples que "abc" à deviner

source: Reversed words aren't much harder to guess
fr: Les mots inversés sont faciles à deviner

source: Sequences like abc or 6543 are easy to guess
fr: Les séquences comme abc ou 6543 sont simples à deviner

source: Short keyboard patterns are easy to guess
fr: Les motifs courts du clavier sont faciles à deviner

source: This is a top-10 common password
fr: Ce mot de passe est dans les 10 plus courants

source: This is a top-100 common password
fr: Ce mot de passe est dans les 100 plus courants

source: This is a very common password
fr: Ce mot de passe est extrêmement courant

source: This is similar to a commonly used password
fr: Ce mot de passe est similaire à un mot de passe courant

source: Use a few words, avoid common phrases
fr: Utilisez quelques mots, évitez les phrases courantes

source: Use a longer keyboard pattern with more turns
fr: Utilisez un motif plus long et plus complexe
